import React from 'react';
import {ScrollView, Text, StyleSheet} from 'react-native';
import {BLUE, GRAY} from '../config/constants';

const HebrewHowTo = props => {
  return (
    <ScrollView style={styles.scrollContainer}>
      <Text style={styles.header}>איך לעשות מודל יהלום</Text>

      <Text style={styles.subheader}>שלב א׳</Text>
      <Text style={styles.info}>
        רשום במשבצת העליונה את המצב הקיים שאתה מעוניין לחקור, זה יכול להיות ממש
        כל דבר. שווה לחקור במיוחד אם הוא מוציא אתכם משלוותכם. לדוגמא: ״מתח במקום
        העבודה״ או ״יש לי פנצ׳ר בגלגל באופניים״. החזק את התחושה , את הרגש, (בשפת
        המטאיזם זה נקרא ״רטט״) שהמצב גורם לך להרגש וכתוב ב 2 המשבצות שמתחת את
        האסוציאציות הראשונות שזה מעלה בך. את הראשונה במשבצת הימנית ואת השנייה
        במשבצת השמאלית.
      </Text>

      <Text style={styles.subheader}>שלב ב׳</Text>
      <Text style={styles.info}>
        התרכזו כעת במילה או צמד המילים במשבצת הימנים, תרגישו ותרטטו את התדר שלה,
        וכתבו ב2 המשבצות את שתי האסוציאציות הראשונות שעולות לכם עם התחושה,
        הראשונה במשבצת הימנית והשנייה בשמאלית. עברו כעת למילה בצד שמאל. הרגישו
        אותה, התחברו אל ה״רטט״ שהיא מביאה וכתבו את שתי האסוציאציות הראשונות
        שעולות לכם הראשנה במשבצת ימנית והשנייה בשמאלית.
      </Text>

      <Text style={styles.subheader}>שלב ג׳</Text>
      <Text style={styles.info}>
        התבוננו בתחושות שנמצאות בשתי המשבצות התחתונות בצד ימין. הרגישו, התחברו
        אל התחושה במשבצת האחת ואז חברו אליה את התחושה שבמשבצת שלשמאלה. כתבו
        במשבצת שמתחת את האסוציאציה הראשונה שעולה. עברו לצד שמאל, הרגישות את
        ה״רטט״ של המשבצת הימנית וחברו אליה את ה״רטט״ של המשבצת השמאלית. רשמו את
        האסוציאציה שעולה לכם במשבצת שמתחת.
      </Text>

      <Text style={styles.subheader}>שלב ד׳</Text>
      <Text style={styles.info}>
        התבוננו בצמד הרטטים האחרונים שמופיעים, התרכזו ב״רטט״ הימני, תרגישו אותו
        ומיד חברו אליו את התחושות שעולות מהמשבצת השנייה. חברו את שני ה״רטטים״
        לאחד באמצעות אסוציאציה חופשית. כתבו את הרטט התת מודע שמוביל את המצב הלא
        רצוי שאתם חוקרים. במטאיזם קוראים לזה ״הפער״. כמו הפער שבין הרצוי למצוי.
        על מנת לאפשר מצב עיניינים נעים יותר, עלינו לעשות עבודה שמובילה לויתור על
        הפער הזה. לתהליך הזה אנו קוראים ״התמרה.״
      </Text>

      <Text style={styles.header}>דגשים לעבודה עם מודל היהלום</Text>
      <Text style={styles.info}>
        אין לחזור על אותה מילה או רטט פעמיים יש תמיד לנוע מהמשבצת הימנית אל
        השמאלית, על מנת לאפשר סנכרון של שתי המוחות, אין לדלג על אף שלב ולקפוץ
        לשלב הבא. יש להמנע מלהחליף רטטים ותחושות שליליים בפתרון . לדוגמא אם יש
        לי שתי משבצות ״פחד״ ו״בחילה״, והאסוציה שבאה לי היא ״לברוח״, סביר להניח
        שלברוח היא הפתרון שאני מוצאת לתחושות הלא נעימות האלו, כשברור שהשילוב
        שלהם הוא ממש בלתי נסבל. ה״בריחה״ במקרה זה היא ה״פתרון ״ לקונפליקט שנוצר.
        אנו רוצים בחקירה שלנו להגיע לעומק התחושה שממנה אנו בורחים. לכן זה יכול
        להיות ״מוות״ לדוגמא. {'\n\n\n\n\n\n\n\n'}
      </Text>
    </ScrollView>
  );
};

const styles = StyleSheet.create({
  scrollContainer: {
    marginLeft: 15,
    marginRight: 15,
  },
  header: {
    color: BLUE,
    fontWeight: 'bold',
    fontSize: 22,
    marginTop: 30,
    marginBottom: 20,
    textAlign: 'right',
  },
  subheader: {
    color: GRAY,
    fontSize: 18,
    fontWeight: 'bold',
    marginTop: 10,
    marginBottom: 10,
    textAlign: 'right',
  },
  info: {
    fontSize: 14,
    textAlign: 'right',
  },
});

export default HebrewHowTo;
